# Найдите сумму цифр трехзначного числа.

n = int(input("Введите трехзначное число: "))
sum = 0
n1 = n%10
n2 = (n//10)%10
n3 = (n//100)%10
sum = n1 + n2 +n3
print (sum)